{
  "films": [
    {
      "nom": "Alien, le huitème passager",
      "dateSortie": "1979-09-12",
      "realisateur": "Ridley Scott",
      "duree": "1h57",
      "resume": "Durant le voyage de retour d'un immense cargo spatial en mission commerciale de routine, ses passagers, cinq hommes et deux femmes plongés en hibernation, sont tirés de leur léthargie dix mois plus tôt que prévu par Mother, l'ordinateur de bord. Ce dernier a en effet capté dans le silence interplanétaire des signaux sonores, et suivant une certaine clause du contrat de navigation, les astronautes sont chargés de prospecter tout indice de vie dans l'espace.",
      "image": "alien.jpg",
      "id": 1
    },
    {
      "id": 2,
      "nom": "Harry Potter à l'école des sorciers",
      "dateSortie": "2001-12-05",
      "realisateur": "Chris Columbus",
      "duree": "2h39",
      "resume": "Orphelin, le jeune Harry Potter peut enfin quitter ses tyranniques oncle et tante Dursley lorsqu'un curieux messager lui révèle qu'il est un sorcier. À 11 ans, Harry va enfin pouvoir intégrer la légendaire école de sorcellerie de Poudlard, y trouver une famille digne de ce nom et des amis, développer ses dons, et préparer son glorieux avenir.",
      "image": "harrypotter.jpg"
    },
    {
      "id": 3,
      "nom": "Jurassic Park",
      "dateSortie": "1993-10-20",
      "realisateur": "Steven Spielberg",
      "duree": "2h08",
      "resume": "Ne pas réveiller le chat qui dort, c'est ce que le milliardaire John Hammond aurait dû se rappeler avant de se lancer dans le clonage de dinosaures. C'est à partir d'une goutte de sang absorbée par un moustique fossilisé que John Hammond et son équipe ont réussi à faire renaître une dizaine d'espèces de dinosaures.",
      "image": "jurassic.jpg"
    },
    {
      "id": 4,
      "nom": "Le seigneur des Anneaux La Communauté de l'Anneau",
      "dateSortie": "2001-12-19",
      "realisateur": "Peter Jackson",
      "duree": "3h48",
      "resume": "Un jeune et timide `Hobbit', Frodon Sacquet, hérite d'un anneau magique. Bien loin d'être une simple babiole, il s'agit d'un instrument de pouvoir absolu qui permettrait à Sauron, le `Seigneur des ténèbres', de régner sur la `Terre du Milieu' et de réduire en esclavage ses peuples. Frodon doit parvenir jusqu'à la `Crevasse du Destin' pour détruire l'anneau.",
      "image": "seigneur.jpg"
    },
    {
      "id": 5,
      "nom": "Retour vers le futur",
      "dateSortie": "1985-10-30",
      "realisateur": "Robert Zemeckis",
      "duree": "1h56",
      "resume": "Le jeune Marty McFly mène une existence anonyme, auprès de sa petite amie Jennifer, seulement troublée par sa famille en crise et un proviseur qui serait ravi de l'expulser du lycée. Ami de l'excentrique professeur Emmett Brown, il l'accompagne tester sa nouvelle expérience : le voyage dans le temps via une DeLorean modifiée. La démonstration tourne mal : des trafiquants d'armes débarquent et assassinent le scientifique.",
      "image": "backtothefuture.jpg"
    },
    {
      "id": 6,
      "nom": "Star Wars Un nouvel Espoir",
      "dateSortie": "1977-10-19",
      "realisateur": "Georges Lucas",
      "duree": "2h05",
      "resume": "Il y a bien longtemps, dans une galaxie très lointaine. La guerre civile fait rage entre l'Empire galactique et l'Alliance rebelle. Capturée par les troupes de choc de l'Empereur menées par le sombre et impitoyable Dark Vador, la princesse Leia Organa dissimule les plans de l'Etoile Noire, une station spatiale invulnérable, à son droïde R2-D2 avec pour mission de les remettre au Jedi Obi-Wan Kenobi.",
      "image": "starwars.jpg"
    }
  ],
  "personnages": [
    {
      "nom": "Ellen Ripley",
      "dateNaissance": "2092-01-07",
      "lieuNaissance": "Olympia",
      "acteur": "Sigourney Weaver",
      "image": "ripley.jpg",
      "filmId": 1,
      "id": 1
    },
    {
      "id": 2,
      "nom": "Dallas",
      "dateNaissance": "2092-01-07",
      "lieuNaissance": "Olympia",
      "acteur": "Sigourney Weaver",
      "image": "dallas.jpg",
      "filmId": 1
    }
  ]
}
